src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ПечатьЗапровочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереливныхВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПриходныхВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерПереливнойВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерПриходнойВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьЗаправочнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПереливнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПриходнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВедомости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВедомостей</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаправочныеВедомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыДляПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаправочнаяВедомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВедомости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/GDS_ТипыЗаправочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_ТипыЗаправочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приходная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заправочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переливная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/GDS_ЗаправочнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_ЗаправочнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.GDS_ДанныеЗаправочнойВедомостиИЗаправок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВедомости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПорядковый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПЛ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПЛ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плотность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзАвтограф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаправленоИзАвтограф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоследниеНомера() Экспорт
	
	ТипыВедомостей = Перечисления.GDS_ТипыЗаправочныхВедомостей;
	ПоследнийНомерПереливнойВедомостей = ПоследнийНомерВедомости(ТипыВедомостей.Переливная);
	
	ПоследнийНомерПриходнойВедомостей = ПоследнийНомерВедомости(ТипыВедомостей.Приходная);
	
	Для Каждого СтрокаЗаправок Из ЗаправочныеВедомости Цикл
		СтрокаЗаправок.ПоследнийНомер = ПоследнийНомерВедомости(ТипыВедомостей.Заправочная, СтрокаЗаправок.Контрагент);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДляОбработкиПоНастройкам() Экспорт
	
	ДанныеПечати = Новый Массив;
	
	КонтрагентПоОрганизации = КонтрагентПоОрганизации();
	
	Если СоздатьПриходнуюВедомость И КоличествоПриходныхВедомостей <> 0 Тогда
		ДанныеСтрокиОбработки = НовыйДанныеСтрокиОбработки();
		ДанныеСтрокиОбработки.ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Приходная;
		ДанныеСтрокиОбработки.АЗС = АЗС;
		ДанныеСтрокиОбработки.Контрагент = КонтрагентПоОрганизации;
		ДанныеСтрокиОбработки.Количество = КоличествоПриходныхВедомостей;
		ДанныеСтрокиОбработки.ПоследнийНомер = ПоследнийНомерПриходнойВедомостей;
		ДанныеСтрокиОбработки.Идентификатор = "ЗаправочнаяВедомостьПриходная";
		ДанныеСтрокиОбработки.ПредставлениеПечатнойФормы = "Заправочная ведомость приходная";
		
		ДанныеПечати.Добавить(ДанныеСтрокиОбработки);
	КонецЕсли;
	
	Если СоздатьПереливнуюВедомость И КоличествоПереливныхВедомостей <> 0 Тогда
		ДанныеСтрокиОбработки = НовыйДанныеСтрокиОбработки();
		ДанныеСтрокиОбработки.ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Переливная;
		ДанныеСтрокиОбработки.АЗС = АЗС;
		ДанныеСтрокиОбработки.Контрагент = КонтрагентПоОрганизации;
		ДанныеСтрокиОбработки.Количество = КоличествоПереливныхВедомостей;
		ДанныеСтрокиОбработки.ПоследнийНомер = ПоследнийНомерПереливнойВедомостей;
		ДанныеСтрокиОбработки.Идентификатор = "ЗаправочнаяВедомостьПереливная";
		ДанныеСтрокиОбработки.ПредставлениеПечатнойФормы = "Заправочная ведомость переливная";
		
		ДанныеПечати.Добавить(ДанныеСтрокиОбработки);
	КонецЕсли;
	
	Если СоздатьЗаправочнуюВедомость Тогда
		Для Каждого СтрокаЗаправок Из ЗаправочныеВедомости Цикл
			Если СтрокаЗаправок.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			ДанныеСтрокиОбработки = НовыйДанныеСтрокиОбработки();
			ДанныеСтрокиОбработки.ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Заправочная;
			ДанныеСтрокиОбработки.АЗС = АЗС;
			ДанныеСтрокиОбработки.Контрагент = СтрокаЗаправок.Контрагент;
			ДанныеСтрокиОбработки.Количество = СтрокаЗаправок.Количество;
			ДанныеСтрокиОбработки.ПоследнийНомер = СтрокаЗаправок.ПоследнийНомер;
			ДанныеСтрокиОбработки.Идентификатор = СтрШаблон("ЗаправочнаяВедомостьЗаправочная%1", СтрокаЗаправок.Контрагент.ИНН);
			ДанныеСтрокиОбработки.ПредставлениеПечатнойФормы = СтрШаблон("Заправочная ведомость заправочная %1", СтрокаЗаправок.Контрагент);
			
			ДанныеПечати.Добавить(ДанныеСтрокиОбработки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция ДанныеДляОбработкиПоДокументам() Экспорт
	
	Запрос = Новый Запрос;
	
	Ведомости = ДокументыДляПечати.ВыгрузитьКолонку("ЗаправочнаяВедомость");
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ЗаправочнаяВедомость.АЗС КАК АЗС,
	|	GDS_ЗаправочнаяВедомость.АЗС.Наименование КАК ГосНомер,
	|	GDS_ЗаправочнаяВедомость.ТипВедомости КАК ТипВедомости,
	|	ПРЕДСТАВЛЕНИЕ(GDS_ЗаправочнаяВедомость.ТипВедомости) КАК ТипВедомостиПредставление,
	|	GDS_ЗаправочнаяВедомость.НомерПорядковый КАК НомерПорядковый,
	|	GDS_ЗаправочнаяВедомость.НомерВходящий КАК НомерВходящий,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(GDS_ЗаправочнаяВедомость.Ссылка) КАК ВедомостьУИН,
	|	GDS_ЗаправочнаяВедомость.Контрагент КАК Контрагент,
	|	GDS_ЗаправочнаяВедомость.Организация КАК Организация
	|ИЗ
	|	Документ.GDS_ЗаправочнаяВедомость КАК GDS_ЗаправочнаяВедомость
	|ГДЕ
	|	GDS_ЗаправочнаяВедомость.Ссылка В(&Ведомости)
	|ИТОГИ ПО
	|	ТипВедомости";
	
	ВыборкаТипВедомости = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДанныеПечати = Новый Структура;
	
	Пока ВыборкаТипВедомости.Следующий() Цикл
		
		ДанныеПоТипуВедеомсти = Новый Массив;
		
		ТипВедомостиПредставление = Строка(ВыборкаТипВедомости.ТипВедомости);
		Идентификатор = СтрШаблон("ЗаправочнаяВедомость%1", ТипВедомостиПредставление);
		ПредставлениеПечатнойФормы = СтрШаблон("Заправочная ведомость %1", НРег(ТипВедомостиПредставление));
		
		Выборка = ВыборкаТипВедомости.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеСтрокиОбработки = НовыйДанныеСтрокиОбработки();
			ДанныеСтрокиОбработки.ТипВедомости = Выборка.ТипВедомости;
			ДанныеСтрокиОбработки.АЗС = Выборка.АЗС;
			ДанныеСтрокиОбработки.Количество = 1;
			ДанныеСтрокиОбработки.ПоследнийНомер = Выборка.НомерПорядковый - 1;
			ДанныеСтрокиОбработки.Идентификатор = Идентификатор;
			ДанныеСтрокиОбработки.ПредставлениеПечатнойФормы = ПредставлениеПечатнойФормы;
			ДанныеСтрокиОбработки.ГосНомер = Выборка.ГосНомер;
			ДанныеСтрокиОбработки.Контрагент = Выборка.Контрагент;
			
			ДанныеСтрокиОбработки.НомерПорядковый = Выборка.НомерПорядковый;
			ДанныеСтрокиОбработки.НомерВходящий = Выборка.НомерВходящий;
			ДанныеСтрокиОбработки.ВедомостьУИН = Строка(Выборка.ВедомостьУИН);
			
			ДанныеПоТипуВедеомсти.Добавить(ДанныеСтрокиОбработки);
			
		КонецЦикла;
		
		ДанныеПечати.Вставить(Идентификатор, ДанныеПоТипуВедеомсти);
		
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция Обработать(ДанныеОбработки) Экспорт
	
	ДокументыНаПечать = ПодготовитьДокументыДляПечати(ДанныеОбработки);
	ЗаполнитьПоследниеНомера();
	Возврат СформироватьПечатнуюФорму(ДокументыНаПечать);
	
КонецФункции

Функция ПодготовитьДокументыДляПечати(ДанныеОбработки) Экспорт
	
	НаименованиеАЗС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбработки.АЗС, "Наименование");
	ПрефиксНомера = ПрефиксНомераВедомости(НаименованиеАЗС);
	
	ДокументыНаПечать = Новый Массив;
	Для Сч = 1 По ДанныеОбработки.Количество Цикл
		
		ДанныеПечати = НовыйДанныеСтрокиОбработки();
		ЗаполнитьЗначенияСвойств(ДанныеПечати, ДанныеОбработки);
		
		ДанныеПечати.ГосНомер = НаименованиеАЗС;
		
		ДанныеПечати.НомерПорядковый = ДанныеОбработки.ПоследнийНомер + Сч;
		ДанныеПечати.НомерВходящий = СтрШаблон("%1%2", ПрефиксНомера, Формат(ДанныеПечати.НомерПорядковый, "ЧЦ=3; ЧВН="));
		
		ДанныеПечати.ВедомостьУИН = СоздатьЗаправочнуюВедомость(ДанныеПечати);
		
		ДокументыНаПечать.Добавить(ДанныеПечати);
		
	КонецЦикла;
	
	Возврат ДокументыНаПечать;
	
КонецФункции

Функция СформироватьПечатнуюФорму(Ведомости) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ПервыйДокумент = Истина;
	Для Каждого ДокументНаПечать Из Ведомости Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		СуффиксОбластей = Строка(ДокументНаПечать.ТипВедомости);
		
		Макет = ПолучитьМакет("Ведомость");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ДокументНаПечать);
		
		ДанныеQR = НовыйДанныеQR();
		Для Каждого КлючЗначение Из ДанныеQR Цикл
			ДанныеQR[КлючЗначение.Ключ] = XMLСтрока(ДокументНаПечать[КлючЗначение.Ключ]);
		КонецЦикла;
		QRСтрока = ОбщегоНазначения.ЗначениеВJSON(ДанныеQR);
		
		ДвоичныеДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
		
		ОбластьРисунка = ОбластьШапка.Области.Найти("РисунокQR");
		ОбластьРисунка.Картинка = Новый Картинка(ДвоичныеДанныеQRКода);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть(СтрШаблон("Шапка%1", СуффиксОбластей));
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ОбластьСтрока = Макет.ПолучитьОбласть(СтрШаблон("Строка%1", СуффиксОбластей));
		Для НомерСтроки = 1 По 16 Цикл
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвал = Макет.ПолучитьОбласть(СтрШаблон("Подвал%1", СуффиксОбластей));
		ОбластьПодвал.Параметры.Заполнить(ДокументНаПечать);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПоследнийНомерВедомости(ТипВедомости, Контрагент = Неопределено)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("АЗС", АЗС);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипВедомости", ТипВедомости);
	Запрос.УстановитьПараметр("Дата", НачалоГода(ДатаВедомостей));
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	GDS_ЗаправочнаяВедомость.НомерПорядковый КАК НомерПорядковый
	|ИЗ
	|	Документ.GDS_ЗаправочнаяВедомость КАК GDS_ЗаправочнаяВедомость
	|ГДЕ
	|	GDS_ЗаправочнаяВедомость.АЗС = &АЗС
	|	И GDS_ЗаправочнаяВедомость.Дата >= &Дата
	|	И GDS_ЗаправочнаяВедомость.Контрагент = &Контрагент
	|	И GDS_ЗаправочнаяВедомость.ТипВедомости = &ТипВедомости
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПорядковый УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПорядковый;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйДанныеСтрокиОбработки()
	
	Данные = Новый Структура;
	Данные.Вставить("ТипВедомости", Перечисления.GDS_ТипыЗаправочныхВедомостей.ПустаяСсылка());
	Данные.Вставить("АЗС", Справочники.уатАЗС.ПустаяСсылка());
	Данные.Вставить("ГосНомер", "");
	Данные.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Данные.Вставить("Количество", 0);
	Данные.Вставить("ПоследнийНомер", 0);
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("ПредставлениеПечатнойФормы", "");
	Данные.Вставить("НомерПорядковый", 0);
	Данные.Вставить("НомерВходящий", "");
	Данные.Вставить("ВедомостьУИН", "");
	
	Возврат Данные;
	
КонецФункции

Функция НовыйДанныеQR()
	
	Данные = Новый Структура;
	Данные.Вставить("ВедомостьУИН", "");
	
	Возврат Данные;
	
КонецФункции

Функция ДанныеПечати(АЗС, Контрагент)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("АЗС", АЗС);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатАЗС.Представление КАК ГосНомер,
	|	уатАЗС.Представление КАК АЗС,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(уатАЗС.Ссылка) КАК АЗСУИН,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК КонтрагентУИН,
	|	Контрагенты.Наименование КАК Контрагент
	|ИЗ
	|	Справочник.уатАЗС КАК уатАЗС,
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И уатАЗС.Ссылка = &АЗС";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПрефиксНомераВедомости(ГосНомер)
	
	Цифры = "";
	
	Для НомерСимвола = 1 По СтрДлина(ГосНомер) Цикл
		
		Символ = Сред(ГосНомер, НомерСимвола, 1);
		
		Если Найти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
			
			Если СтрДлина(Цифры) = 3 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Цифры;
	
КонецФункции

Функция СоздатьЗаправочнуюВедомость(ДанныеПечати)
	
	Ведомость = НайтиЗаправочнуюВедомость(ДанныеПечати);
	Если ЗначениеЗаполнено(Ведомость) Тогда
		Возврат XMLСтрока(Ведомость);
	КонецЕсли;
	
	Ведомость = Документы.GDS_ЗаправочнаяВедомость.СоздатьДокумент();
	Ведомость.Заполнить(ДанныеПечати);
	Ведомость.Дата = ДатаВедомостей;
	Ведомость.Организация = Организация;
	Ведомость.Ответственный = Пользователи.ТекущийПользователь();
	
	Ведомость.Записать();
	
	Возврат XMLСтрока(Ведомость.Ссылка);
	
КонецФункции

Функция НайтиЗаправочнуюВедомость(ДанныеПечати)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АЗС", ДанныеПечати.АЗС);
	Запрос.УстановитьПараметр("Контрагент", ДанныеПечати.Контрагент);
	Запрос.УстановитьПараметр("НомерПорядковый", ДанныеПечати.НомерПорядковый);
	Запрос.УстановитьПараметр("ТипВедомости", ДанныеПечати.ТипВедомости);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ЗаправочнаяВедомость.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.GDS_ЗаправочнаяВедомость КАК GDS_ЗаправочнаяВедомость
	|ГДЕ
	|	GDS_ЗаправочнаяВедомость.АЗС = &АЗС
	|	И GDS_ЗаправочнаяВедомость.Контрагент = &Контрагент
	|	И GDS_ЗаправочнаяВедомость.ТипВедомости = &ТипВедомости
	|	И GDS_ЗаправочнаяВедомость.НомерПорядковый = &НомерПорядковый";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.GDS_ЗаправочнаяВедомость.ПустаяСсылка();
	
КонецФункции

Функция КонтрагентПоОрганизации()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Организации.ИНН = Контрагенты.ИНН
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Организации.Ссылка = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
